[
  {
    "quote": "The future belongs to those who believe in the beauty of their dreams.",
    "author": "Eleanor Roosevelt"
  },
  {
    "quote": "Believe you can and you're halfway there.",
    "author": "Theodore Roosevelt"
  },
  {
    "quote": "Believe you can and you're halfway there.",
    "author": "Theodore Roosevelt"
  },
  {
    "quote": "Believe you can and you're halfway there.",
    "author": "Theodore Roosevelt"
  },
  {
    "quote": "The only way to do great work is to love what you do.",
    "author": "Steve Jobs"
  },
  {
    "quote": "Optimism is the one quality more associated with success and happiness than any other.",
    "author": "Brian Tracy"
  },
  {
    "quote": "Fear can hold you prisoner. Hope can set you free.",
    "author": "Stephen King"
  },
  {
    "quote": "Never put off to tomorrow what you can do to-day.",
    "author": "Thomas Jefferson"
  },
  {
    "quote": "Don't cry because it's over. Smile because it happened.",
    "author": "Dr. Seuss"
  },
  {
    "quote": "You are never too old to set another goal or to dream a new dream.",
    "author": "Les Brown"
  },
  {
    "quote": "Positive thinking can be contagious. Being surrounded by winners helps you develop into a winner.",
    "author": "Arnold Schwarzenegger"
  },
  {
    "quote": "Our life is what our thoughts make it. A man will find that as he alters his thoughts toward things and other people, things and other people will alter towards him.",
    "author": "James Allen"
  },
  {
    "quote": "The greatest development comes from embracing challenges and learning from them.",
    "author": "Carol Dweck"
  },
  {
    "quote": "There is no path to Happiness. Happiness is the path.",
    "author": "Dan Millman"
  },
  {
    "quote": "All happiness depends on courage and work.",
    "author": "Honore de Balzac"
  },
  {
    "quote": "Sometimes things become possible if we want them bad enough.",
    "author": "T.S. Eliot"
  },
  {
    "quote": "People who bite the hand that feeds them usually lick the boot that kicks them.",
    "author": "Eric Hoffer"
  },
  {
    "quote": "Live and act within the limit of your knowledge and keep expanding it to the limit of your life.",
    "author": "Ayn Rand"
  },
  {
    "quote": "Difficulties strengthen the mind, as labor does the body.  ",
    "author": "Seneca"
  },
  {
    "quote": "Half the world is composed of people who have something to say and can't, and the other half who have nothing to say and keep on saying it.",
    "author": "Robert Frost"
  },
  {
    "quote": "The greatest enemy of knowledge is not ignorance, it's the illusion of knowledge.",
    "author": "Stephen Hawking"
  },
  {
    "quote": "If the only prayer you ever say in your entire life is thank you, it will be enough.",
    "author": "Meister Eckhart"
  },
  {
    "quote": "It takes a great deal of bravery to stand up to our enemies, but just as much to stand up to our friends.",
    "author": "Albus Dumbledore"
  },
  {
    "quote": "Youth is happy because it has the ability to see beauty. Anyone who keeps the ability to see beauty never grows old. ",
    "author": "Franz Kafka"
  },
  {
    "quote": "The sweetest pleasure arises from difficulties overcome.",
    "author": "Publilius Syrus"
  }
]